dummy_app/app/models/wow/character.rb

    def can_only_have_one_main
      return if priority == "alt" || (user.characters.where(priority: "main") - [self]).blank?
---
SELECT "wow_characters".* FROM "wow_characters" WHERE "wow_characters"."user_id" = $1 AND "wow_characters"."priority" = $2  [["user_id", 2], ["priority", "1"]]