dummy_app/app/policies/wow/character_policy.rb

SELECT 1 AS one FROM "wow_characters" WHERE "wow_characters"."user_id" = $1 AND "wow_characters"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def owner?
      return true if user.characters.include?(record)