dummy_app/app/controllers/calendar/events_controller.rb

UPDATE "users" SET "updated_at" = $1, "last_activity_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-08 19:06:40.588646"], ["last_activity_at", "2020-05-08 19:06:40.588646"], ["id", 2]]
---
  def create
    @object = current_model.public_send(:new, object_params.merge(user_id: current_user.id))
    authorize(@object)

    if @object.save