app/views/shared/_notifications.html.slim

    .notifications-wrapper
      - current_user.web_notifications.each do |web_notification|
        .notification-item[class=notification_class_helper(web_notification)]
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 ORDER BY "notifications"."created_at" DESC  [["user_id", 2]]