dummy_app/app/controllers/wow/characters_controller.rb

SELECT "wow_races"."name", "wow_races"."id" FROM "wow_races"
SELECT "wow_classes"."name", "wow_classes"."id" FROM "wow_classes"
SELECT "wow_roles"."name", "wow_roles"."id" FROM "wow_roles"
---
          type: :text_field
        },
        wow_race_id: {
          type: :select,
          collection: Wow::Race.all.pluck(:name, :id),
          skip_index: true
        },
        wow_class_id: {
          type: :select,
          collection: Wow::Class.all.pluck(:name, :id),
          skip_index: true
        },
        wow_role_id: {
          type: :select,
          collection: Wow::Role.all.pluck(:name, :id),
          skip_index: true

UPDATE "users" SET "updated_at" = $1, "last_activity_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-12 21:13:03.806431"], ["last_activity_at", "2020-05-12 21:13:03.806431"], ["id", 2]]
---
  def create
    @object = current_model.public_send(:new, object_params.merge(user_id: current_user.id))
    authorize(@object)

    if @object.save