dummy_app/app/controllers/wow/search_controller.rb

  def index
    authorize([:wow, :search])
    items = Wow::Item.filter_by_name(params[:query]).limit(10).pluck(:name, :id)
---
SELECT "wow_items"."name", "wow_items"."id" FROM "wow_items" WHERE (cast(id as varchar) LIKE ('%a%') OR name ILIKE ('%a%')) LIMIT $1  [["LIMIT", 10]]