dummy_app/app/views/wow/characters/_form.html.slim

SELECT "wow_characters".* FROM "wow_characters" WHERE "wow_characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "wow_items".* FROM "wow_items" WHERE "wow_items"."id" = $1 LIMIT $2  [["id", 16914], ["LIMIT", 1]]
---
        - if item_id.present?
          = select_tag "wow_character[#{item_name}]", options_for_select([[Wow::Item.find(item_id).name, item_id]], item_id), { include_blank: true, id: "wow_character_#{item_name}", class: "custom-select" }